{
  "ep": {
    "desc": "COGNITIO'26 presents an exciting opportunity to test your mettle through the ELEVATOR PITCH event. Participants will present their unique ideas aligned with Mechamorph and showcase a comprehensive B-PLAN. This plan should include market research, competitor analysis, USP, revenue model, investments required, and marketing strategy. Students will be judged based on these parameters, along with any other relevant points they include.",
    "details1": [
      "Team size: 2 students",
      "Open problem statement for innovation"
    ],
    "details2": [
      {
        "heading": "ROUND 1: IDEA SUBMISSION",
        "points": [
          "This will be a submission round. All teams must submit their business ideas in PPT format.",
          "Maximum number of slides permitted is 10 (Exclusive of Cover Page).",
          "Top 10 teams will advance to the next round."
        ]
      },
      {
        "heading": "ROUND 2: IDEA PITCHING",
        "points": [
          "Selected teams from Round 1 will pitch their ideas before the judges.",
          "Time limit of the presentation is 20 minutes.",
          "Presentation will be followed by questions from the judges."
        ]
      }
    ],
    "eh": ["Anand Yadav","Muskan Kumari"],
    "prize": "7000",
    "name": "ELEVATOR PITCH",
    "img": "/events/Elevator Pitch.png"
  },
  "quiriosity": {
    "desc": "Mechamorph - the art of mechanical transformation - is a crucial element in the design and development process. This year's Quriosity will be on Mechamorph. To all the quiz geeks out there, brace yourself and be ready for your quizzing mettle to be tested. It is the time to compete with the finest brains of the institute and enrich your quizzing skills. QURIOSITY provides a platform to explore the charm of science and technology. To come up as a winner, you need to possess noetic and quick thinking.",
    "details1": ["Number of students in a team: 2"],
    "details2": [
      {
        "heading": "ROUND 1",
        "points": ["Pen and paper-based preliminary test"]
      },
      {
        "heading": "ROUND 2",
        "points": [
          "6 Teams will be selected on-spot from the prelims for the final quiz competition."
        ]
      }
    ],
    "eh": ["Sandeep Shaw"],
    "prize": "7000",
    "name": "QURIOSITY",
    "img": "/events/Quriosity.png"
  },
  "dictumSymposium": {
    "desc": "Greatest quality of a leader is wisdom of opinion and way of expression. COGNITIO '26 brings you the opportunity to get into the war of words. Buckle up, for this is the event you craved for. Let your larynx vibrate and your words echo the whole house. DICTUM SYMPOSIUM brings all of you the experience of speaking as a leader. The event deals with expression of opinion/defending your stand on corporate issues by highlighting its social, economic, environmental, and technical impacts.",
    "details1": ["Number of students in a team: 2"],
    "details2": [
      {
        "heading": "ROUND 1: ABSTRACT SUBMISSION",
        "points": [
          "Describing your views on one of the prescribed topics."
        ]
      },
      {
        "heading": "ROUND 2: EXTEMPORE TOPICS",
        "points": [
          "Topics will be provided on spot and the team members have to present their views on the same."
        ]
      },
      {
        "heading": "ROUND 3: DEBATE",
        "points": [
          "Topics will be provided beforehand. 2 teams have to debate with each other with the members of each team speaking alternatively."
        ]
      }
    ],
    "eh": [
     "Aditya Kumar"
    ],
    "prize": "5500",
    "name": "DICTUM SYMPOSIUM",
    "img": "/events/Dictum symposium.png"
  },
  "sas": {
    "desc": "Propulsion systems are highly powerful driving technologies enabling the physical essence of distant places. The event deals with water propulsion system in rocket technology resulting in a working Mechamorph build showcasing the application of physical concepts. Put all your concepts of kinematics, aerodynamics & hydraulics to build a Water Rocket that covers the maximum range.",
    "details1": [
      "Number of students in a team: 3",
      "Materials required to build Water Rocket will have to be brought by participants.",
      "The team members will have to launch their Water Rocket themselves under the supervision of the event coordinators.",
      "The participants will get three chances to launch their model. The maximum range covered out of the three will be taken for consideration."
    ],
    "details2": [
      {
        "heading": "ROUND 1: WORKSHOP + DESIGN IT!",
        "points": [
          "Participants will use industry-standard software like CATIA or SolidWorks to create a unique and functional design based on the problem statement provided. Also, there will be a workshop held about it. Creativity, precision, and adherence to design requirements will be evaluated in this phase."
        ]
      },
      {
        "heading": "ROUND 2: SIMULATE IT!",
        "points": [
          "The design created in Round 1 will be tested in a virtual environment using ANSYS simulation software. Participants must analyze the structural integrity, thermal performance, or other relevant parameters of their designs. The goal is to optimize the design for real-world challenges.",
          "Top 6 teams will advance to Round 3 i.e. final round."
        ]
      },
      {
        "heading": "ROUND 3: PROTOTYPE IT!",
        "points": [
          "The final and most thrilling round involves transforming your virtual design into a tangible model using 3D printing. Participants will showcase their prototypes and explain how they align with the competition's goals. The best-performing prototype, judged on innovation, functionality, and quality, will claim the title of Mechamorph Champion."
        ]
      }
    ],
    "eh": [
      "Chanchal Kumari",
      "Rishav Kumar",
      "Premdeep"
    ],
    "prize": "7000",
    "name": "SHOOT AT SIGHT",
    "img": "/events/Shoot at sight.png"
  },
  "robowar": {
    "desc": "COGNITIO '26 presents ROBO WAR - where machines clash and engineering meets aggression. Gear up to witness raw power, precision, and strategy collide in an ultimate battle of bots. Design, build, and unleash your combat robot to dominate the arena. Only the toughest machines and smartest minds survive this war.",
    "details1": [
      "Weight category: 3 kg (+/- 5%)"
    ],
    "details2": [
      {
        "heading": "ROUND 1: ABSTRACT SUBMISSION",
        "points": [
          "Submission of bot design, weapon mechanism, drive system, and combat strategy."
        ]
      },
      {
        "heading": "ROUND 2: DESIGN & FABRICATION",
        "points": [
          "Teams will fabricate their robots using the provided kit and allowed additional materials."
        ]
      },
      {
        "heading": "ROUND 3: ARENA BATTLE",
        "points": [
          "Robots will fight head-to-head in knockout matches until a winner emerges."
        ]
      }
    ],
    "eh": [
      "Sourav Singh Mahara"
    ],
    "prize": "11000",
    "name": "ROBOWAR",
    "img": "/events/Robowar.png"
  },
  "cultural night": {
    "desc": "COGNITIO '26 brings you CULTURAL NIGHT - a celebration beyond engineering. After days of competition and innovation, it's time to let loose. Music, dance, energy, and vibes - Cultural Night is where talent takes the spotlight and memories are made.",
    "details1": [
      "Participation: Individual / Group",
      "Performances include: Dance, Music, Drama, Open Mic"
    ],
    "details2": [
      {
        "heading": "Event Flow",
        "points": [
          "Performances will be shortlisted based on registrations and rehearsals."
        ]
      }
    ],
    "eh": ["NA"],
    "prize": "NA",
    "name": "CULTURAL NIGHT",
    "img": "/events/Cultural.png"
  },
  "lockItIn": {
    "desc": "COGNITIO '26 presents LOCK IT IN - where fun, chaos, and quick thinking collide. Get ready for an event packed with laughter, energy, and pure entertainment. LOCK IT IN is designed to test not just your knowledge, but your presence of mind, teamwork, and sense of humor. From brain-teasing questions to hilarious performances, this event promises nonstop fun.",
    "details1": [
      "Number of students in a team: 4"
    ],
    "details2": [
      {
        "heading": "ROUND 1: FUN QUIZ",
        "points": [
          "An engaging quiz round filled with quirky, general, and surprise questions to test your quick thinking."
        ]
      },
      {
        "heading": "ROUND 2: DUMB CHARADES",
        "points": [
          "No words, only actions. Teams must guess movies, phrases, or situations through hilarious enactments."
        ]
      },
      {
        "heading": "ROUND 3: KBC-STYLE ROUND",
        "points": [
          "A rapid-fire question round inspired by Kaun Banega Crorepati, where strategy, confidence, and teamwork decide the winner."
        ]
      }
    ],
    "eh": [
      "MES"
    ],
    "prize": "4000",
    "name": "LOCK IT IN",
    "img": "/events/lockitin.png"
  },
  "assemblage": {
    "desc": "Strength of mechanical models and engineering structures is an important area of study and experimentation. Concept and principles dealing with truss systems, beam loadings, stress-strain calculation and representation are imperative for evaluating the failure point of structures. Also, the knowledge of material science and vibration is essential to understand the mechanical behaviors and dynamics of the system under consideration. This event deals with fabrication of a bridge model and its strength testing using varied types of loads.",
    "details1": [
      "Number of students in a team: 3",
      "The team has to construct a bridge model.",
      "Required materials will be provided on spot.",
      "The structure will be tested under loads of different nature and value and corresponding points will be awarded."
    ],
    "details2": [
      {
        "heading": "ROUND 1",
        "points": ["Written test on related concepts"]
      },
      {
        "heading": "ROUND 2",
        "points": [
          "Conceptual Design submission, Bridge Model construction, Strength Testing."
        ]
      }
    ],
    "eh": [
      "Pooja Rani",
      "Saurabh Kumar",
      "Adarsh Gupta"
    ],
    "prize": "7000",
    "name": "ASSEMBLAGE",
    "img": "/events/Assemblage.png"
  },
  "Cansys": {
    "desc": "COGNITIO '26 brings you CANSYS - where design meets analysis. Turn imagination into reality using CAD and CAE tools. This event tests your ability to design, analyze, and justify your model under real-world engineering constraints. Precision, logic, and software skills are the keys to victory.",
    "details1": [
      "Number of students in a team: 2"
    ],
    "details2": [
      {
        "heading": "ROUND 1: PROBLEM STATEMENT",
        "points": [
          "A design problem will be given on the spot."
        ]
      },
      {
        "heading": "ROUND 2: CAD MODELLING",
        "points": [
          "Participants must create a 3D model using SolidWorks/CATIA."
        ]
      },
      {
        "heading": "ROUND 3: ANALYSIS",
        "points": [
          "Structural analysis using ANSYS followed by evaluation of results and calculations."
        ]
      }
    ],
    "eh": [
      "Tanisha Srivastava",
      "Mayank Srivastava"
    ],
    "prize": "5500",
    "name": "CANSYS",
    "img": "/events/Cansys.png"
  },
  "placestation": {
    "desc": "Do you consider yourself an all-rounder? Do you have a unique way of accomplishing goals? Do you stand out in a crowd? Come enter this corporate labyrinth, where one can live and experience the nerve-wracking placement session in a real-time dynamic environment with a series of stations comprising of the comprehensive written test, expressive group discussion as you make your way through the maze to the final round which is the personal interview. It's an all-round competitive event with a motive to guide the students about campus placements and at the same time select the best. So if you think you've got what it takes to make a mark, then do come and be a part of this grand event.",
    "details1": [],
    "details2": [
      {
        "heading": "ROUND 1",
        "points": [
          "Written Test involving aptitude, logical reasoning, and technical questions. (Core and Analytics)",
          "Written Test involving aptitude, logical reasoning, and coding questions. (SDE)"
        ]
      },
      {
        "heading": "ROUND 2",
        "points": [
          "Group Discussion on practical and abstract topics (Core)",
          "Personal Interview - Technical (Analytics and SDE)"
        ]
      },
      {
        "heading": "ROUND 3",
        "points": [
          "Personal Interview – Technical and HR (Core)",
          "Personal Interview – HR (Analytics and SDE)"
        ]
      }
    ],
    "eh": [
      "Neeraj Kumar",
      "Satya Ranjan",
      "Arpit Kumar",
      "Abha Yadav",
      "Ajay Prajapati"
    ],
    "prize": "6000",
    "name": "PLACE STATION",
    "img": "/events/playstation2.jpeg"
  },
  "posterPresentation": {
    "desc": "COGNITIO ’26 presents POSTER PRESENTATION — where ideas speak louder than words. A platform to showcase innovation, research, and creativity through visual storytelling. Present your ideas, defend your concepts, and leave an impact with clarity and confidence.",
    "details1": [
      "Number of students in a team: 2"
    ],
    "details2": [
      {
        "heading": "ROUND 1: ABSTRACT SUBMISSION",
        "points": [
          "Submission of abstract based on prescribed themes."
        ]
      },
      {
        "heading": "ROUND 2: POSTER PRESENTATION AND PROTOTYPING",
        "points": [
          "Participants will present their posters and prototype and explain their concepts to the judges."
        ]
      },
      {
        "heading": "ROUND 3: QUESTION & ANSWER",
        "points": [
          "Evaluation based on understanding, presentation skills, and originality."
        ]
      }
    ],
    "eh": ["Dr Vijay Kumar Dalla Sir"],
    "prize": "15000",
    "name": "POSTER PRESENTATION",
    "img": "/events/poster present.jpeg"
  }
}
